tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Command-line fuzzy finder written in Go
brew "fzf"
# Platform built on V8 to build network applications
brew "node"
# Gatsby command-line interface
brew "gatsby-cli"
# Distributed revision control system
brew "git"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Fast linters runner for Go
brew "golangci-lint"
# Database client and tools for the Go vulnerability database
brew "govulncheck"
# Network logon cracker which supports many services
brew "hydra"
# Simple terminal UI for git commands
brew "lazygit"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Generic machine emulator and virtualizer
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Open source relational database management system
brew "mysql", restart_service: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@16"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal multiplexer
brew "tmux"
# Fast CSV toolkit written in Rust
brew "xsv"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# GPU-accelerated terminal emulator
cask "alacritty"
# GPU-based terminal emulator
cask "kitty"
# Open-source software for live streaming and screen recording
cask "obs"
